# Relatório IV

## Seleções e frequências

In [ ]:
#Tarefa
#Selecione somente os imóveis classificados com tipo 'Apartamento'., mudei pq apaguei aptos anteriormente

#Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.

#Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.

#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [2]:
import pandas as pd
print('Pandas importado com sucesso...')

Pandas importado com sucesso...

In [7]:
dados = pd.read_csv('dados/aluguel_residencial.csv',sep = ';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
1,Casa,Campo Grande,4,1,2,400,12000.0,0.0,0.0,30.00,Casa
2,Casa,Méier,2,0,0,51,1500.0,50.0,0.0,29.41,Casa
3,Casa,Maracanã,8,3,5,259,7000.0,0.0,0.0,27.03,Casa
4,Casa,Benfica,1,0,0,33,1200.0,0.0,0.0,36.36,Casa
5,Casa,Jardim Carioca,3,2,1,135,3000.0,0.0,0.0,22.22,Casa
6,Casa,Lins de Vasconcelos,2,0,0,40,950.0,0.0,50.0,23.75,Casa
7,Casa,Tijuca,4,1,1,191,4000.0,300.0,0.0,20.94,Casa
8,Casa,Grajaú,5,4,2,450,7000.0,0.0,500.0,15.56,Casa
9,Casa,Tanque,2,1,0,59,1200.0,170.0,0.0,20.34,Casa

In [13]:
#Selecione somente os imóveis classificados com tipo 'Casa'.-> modifiquei pq removi apto anteriomente
casa = dados['Tipo'] == 'Casa'
casa
n1 = dados[casa].shape[0]
n1

898

In [20]:
#Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
sel = (dados['Tipo'] == 'Casa')| (dados['Tipo'] == 'Casa de Condomínio')| (dados['Tipo'] == 'Casa de Vila')#usamos | como 'or'
sel
n2 = dados[sel].shape[0]
n2

2095

In [29]:
#Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
sel2 = (dados['Area'] >= 60) & (dados['Area'] <= 100)#usamos & como 'and'
sel2
n3 = dados[sel2].shape[0]
n3

483

In [34]:
#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.
sel3 = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)
sel3
n4 = dados[sel3].shape[0]
n4

18

In [40]:
print(f"Existem {n1} imóveis classificados com tipo 'Apartamento'.")#fazendo graça com o print f'{n1}
print(f"Existem {n2} imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.")
print(f"Existem {n3} imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.")
print(f"Existem {n4} imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.")

Existem 898 imóveis classificados com tipo 'Apartamento'.
Existem 2095 imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
Existem 483 imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
Existem 18 imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [51]:
#tarefa 2, ex 1
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
ex1 = alunos['Aprovado'] == True
alunos[ex1]

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [54]:
#tarefa 2, ex 2
ex2 = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
alunos[ex2]

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [56]:
#tarefa 2, ex 3
ex3 = (alunos['Idade'] < 20) | (alunos['Idade'] > 40)
alunos[ex3].shape[0]

4